# Pandas DataFrame astype

In [1]:
import pandas as pd

In [2]:
sales_data = pd.DataFrame({ "name": ["John", "Alice", "Bob", "Eva", "Mike", "Laura", "David", "Sophie", "Daniel", "Linda", "Matthew"],
    "region": ["North", "South", "East", "West", "Central", "North", "South", "East", "West", "Central", "North"],
    "sales": [50000, 60000, 75000, 48000, 90000, 55000, 62000, 71000, 49000, 88000, 53000],
    "expenses": [30000, 25000, 35000, 28000, 40000, 28000, 32000, 39000, 27000, 42000, 31000]
}, dtype = "object" )

In [3]:
sales_data

       name   region  sales expenses
0      John    North  50000    30000
1     Alice    South  60000    25000
2       Bob     East  75000    35000
3       Eva     West  48000    28000
4      Mike  Central  90000    40000
5     Laura    North  55000    28000
6     David    South  62000    32000
7    Sophie     East  71000    39000
8    Daniel     West  49000    27000
9     Linda  Central  88000    42000
10  Matthew    North  53000    31000

In [4]:
sales_data.dtypes

name        object
region      object
sales       object
expenses    object
dtype: object

In [5]:
sales_data['sales'] = sales_data['sales'].astype(int) # astype is a method and it has integer as a parameter

In [6]:
sales_data.dtypes

name        object
region      object
sales        int32
expenses    object
dtype: object

In [7]:
# see now, it is the datatype changed to integer

In [8]:
# if we want to change the datatype of multiple columns, we can directly apply the astype method to the dataframe itself not the series

In [9]:
type(sales_data['sales'])

pandas.core.series.Series

In [10]:
sales_data.dtypes

name        object
region      object
sales        int32
expenses    object
dtype: object

In [11]:
# To change the entire column dtypes

In [12]:
sales_data = sales_data.astype({"expenses":int}) # we can give multiple columns here

In [13]:
sales_data

       name   region  sales  expenses
0      John    North  50000     30000
1     Alice    South  60000     25000
2       Bob     East  75000     35000
3       Eva     West  48000     28000
4      Mike  Central  90000     40000
5     Laura    North  55000     28000
6     David    South  62000     32000
7    Sophie     East  71000     39000
8    Daniel     West  49000     27000
9     Linda  Central  88000     42000
10  Matthew    North  53000     31000

In [14]:
sales_data.dtypes

name        object
region      object
sales        int32
expenses     int32
dtype: object

In [15]:
sales_data.region

0       North
1       South
2        East
3        West
4     Central
5       North
6       South
7        East
8        West
9     Central
10      North
Name: region, dtype: object